//
//  Data.m
//  BiGuan
//
//  Created by gwh on 2020/2/6.
//  Copyright © 2020 gwh. All rights reserved.
//

#import "Data.h"

@implementation Data

+ (instancetype)shared {
    return [ccs registerSharedInstance:self];
}

- (NSArray *)stateList {
    return @[
    @{@"name":@"体温",@"items":@[@"偏低",@"偏高",@"正常"]},
    @{@"name":@"呼吸",@"items":@[@"微弱",@"急促",@"正常"]},
    @{@"name":@"饮水",@"items":@[@"过少",@"水肿",@"正常"]},
    @{@"name":@"饮食",@"items":@[@"饥饿",@"饱腹",@"撑死",@"正常"]},
    @{@"name":@"体重",@"items":@[@"减轻",@"富态",@"正常"]},
    @{@"name":@"精神",@"items":@[@"失常",@"呆滞",@"正常"]},
    @{@"name":@"心情",@"items":@[@"低落",@"亢奋",@"吃惊",@"生无可恋",@"正常"]},

    ];
}

- (NSArray *)productsList {
    return @[

    @{@"name":@"饮用水",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"食物",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"食用盐",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"糖",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"水果",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"餐巾纸",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"肥皂🧼",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"牙膏",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"护肤品",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"消毒液",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"口罩",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    @{@"name":@"手机电量🔋",@"items":@[@"匮乏",@"少量",@"充足",@"一般"]},
    ];
}

@end
